app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1
---
  def index
    @projects = current_user.projects.all

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 2 AND "projects"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @project = current_user.projects.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1 AND "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @project = current_user.projects.find(params[:id])

INSERT INTO "projects" ("created_at", "description", "factor", "name", "unit", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = current_user.projects.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1 AND "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def newfileupload
    @project = current_user.projects.find(params[:project_id])

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1 AND "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def fileupload
    @project = current_user.projects.find(params[:project_id])